Revit 2026 API

# ExportIFCCategoryInfoIFCPredefinedType Property

---

The name of the predefined type mapped to a particular Revit category.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string IFCPredefinedType { get; set; }
```
```vb
Public Property IFCPredefinedType As String
	Get
	Set
```
```cpp
public:
property String^ IFCPredefinedType {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member IFCPredefinedType : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

ExportIFCCategoryInfo Class

Autodesk.Revit.DB Namespace